{
    "projects": [
      {
        "id": "1",
        "title": "Modern E-commerce Platform",
        "description": "A fully responsive e-commerce platform built with React and Node.js, featuring user authentication, product filtering, and secure payment processing.",
        "thumbnailUrl": "assets/images/projects/ecommerce.jpg",
        "imageUrls": [
          "assets/images/projects/ecommerce-1.jpg",
          "assets/images/projects/ecommerce-2.jpg",
          "assets/images/projects/ecommerce-3.jpg"
        ],
        "categories": ["Web Development", "E-commerce"],
        "technologies": ["React", "Node.js", "MongoDB", "Express", "Stripe API"],
        "featured": true,
        "demoUrl": "https://demo-ecommerce.rakibrabby.com",
        "codeUrl": "https://github.com/mrakibbd/ecommerce-platform",
        "details": "This modern e-commerce platform was built to provide small businesses with an affordable yet powerful online store solution. The application features a responsive design that works across all devices, user authentication with different permission levels, product filtering and search functionality, shopping cart with persistent storage, and secure payment processing through Stripe API. The admin dashboard allows store owners to manage products, track orders, and analyze sales data without technical knowledge.",
        "challenges": "The biggest challenge was implementing a real-time inventory management system that could handle concurrent user sessions without overselling products. I solved this by using MongoDB transactions and implementing a reservation system for products added to cart.",
        "outcomes": "The platform has helped multiple small businesses establish their online presence, with one client reporting a 45% increase in sales within the first three months of launch."
      },
      {
        "id": "2",
        "title": "Task Management Application",
        "description": "A collaborative task management application with real-time updates, drag-and-drop interface, and team collaboration features.",
        "thumbnailUrl": "assets/images/projects/task-manager.jpg",
        "imageUrls": [
          "assets/images/projects/task-manager-1.jpg",
          "assets/images/projects/task-manager-2.jpg"
        ],
        "categories": ["Web Application", "Productivity"],
        "technologies": ["Vue.js", "Firebase", "Vuex", "CSS Grid"],
        "featured": true,
        "demoUrl": "https://task-app.rakibrabby.com",
        "codeUrl": "https://github.com/mrakibbd/task-management-app",
        "details": "This task management application was designed for remote teams to collaborate effectively. It features customizable workspaces, real-time updates using Firebase, drag-and-drop interfaces for task prioritization, file attachments, commenting system, and detailed analytics to track team productivity. The application supports multiple view options including Kanban boards, lists, and calendar views.",
        "challenges": "Implementing real-time synchronization across multiple clients while maintaining performance was challenging. I optimized the Firebase queries and implemented debouncing to reduce unnecessary updates.",
        "outcomes": "The application is currently used by 12 teams with over 500 active users, helping them increase their productivity by approximately 30%."
      },
      {
        "id": "3",
        "title": "Health & Fitness Mobile App",
        "description": "A cross-platform mobile application for tracking workouts, nutrition, and health metrics with personalized recommendations.",
        "thumbnailUrl": "assets/images/projects/fitness-app.jpg",
        "imageUrls": [
          "assets/images/projects/fitness-app-1.jpg",
          "assets/images/projects/fitness-app-2.jpg",
          "assets/images/projects/fitness-app-3.jpg"
        ],
        "categories": ["Mobile Development", "Health"],
        "technologies": ["React Native", "Redux", "Node.js", "MongoDB", "Chart.js"],
        "featured": true,
        "demoUrl": "https://fitnessapp.rakibrabby.com",
        "codeUrl": "https://github.com/mrakibbd/fitness-tracker-app",
        "details": "This fitness application helps users track their fitness journey across multiple dimensions: workout plans, nutrition, sleep, and health metrics. The app features customizable workout routines, a barcode scanner for easy food logging, integration with wearable devices to import health data, visual progress reports, and AI-powered recommendations based on user goals and progress.",
        "challenges": "Integrating with various health APIs and wearable devices required handling multiple data formats and protocols. I created a unified data model and adapter pattern to normalize the data.",
        "outcomes": "The app has been downloaded over 10,000 times with a 4.7/5 rating on app stores. Users report an average 65% better adherence to their fitness goals."
      },
      {
        "id": "4",
        "title": "Real Estate Listing Platform",
        "description": "A comprehensive real estate platform with advanced search, virtual tours, and mortgage calculator features.",
        "thumbnailUrl": "assets/images/projects/real-estate.jpg",
        "imageUrls": [
          "assets/images/projects/real-estate-1.jpg",
          "assets/images/projects/real-estate-2.jpg"
        ],
        "categories": ["Web Development", "Real Estate"],
        "technologies": ["Angular", ".NET Core", "SQL Server", "Google Maps API", "Three.js"],
        "featured": false,
        "demoUrl": "https://realestate.rakibrabby.com",
        "codeUrl": "https://github.com/mrakibbd/real-estate-platform",
        "details": "This real estate platform helps connect property buyers, sellers, and agents. It features geo-location based property search, advanced filtering options, virtual 3D property tours, appointment scheduling with agents, mortgage calculator with personalized rate options, and a comprehensive dashboard for real estate agents to manage listings and client communications.",
        "challenges": "Implementing the 3D virtual tour feature required optimizing large 3D models for web delivery. I implemented lazy loading and progressive rendering to improve performance.",
        "outcomes": "The platform helped a local real estate agency increase their digital leads by 78% and reduced their average property sale time by 23 days."
      },
      {
        "id": "5",
        "title": "Learning Management System",
        "description": "An interactive learning platform with course creation tools, progress tracking, and gamification elements.",
        "thumbnailUrl": "assets/images/projects/lms.jpg",
        "imageUrls": [
          "assets/images/projects/lms-1.jpg",
          "assets/images/projects/lms-2.jpg"
        ],
        "categories": ["Web Application", "Education"],
        "technologies": ["React", "Node.js", "MongoDB", "WebSockets", "AWS S3"],
        "featured": false,
        "demoUrl": "https://lms-demo.rakibrabby.com",
        "codeUrl": "https://github.com/mrakibbd/learning-management-system",
        "details": "This learning management system enables educators to create and deliver interactive online courses. The platform includes a drag-and-drop course builder, interactive quizzes and assignments, progress tracking for both students and instructors, discussion forums with real-time notifications, video conferencing integration, and gamification elements like badges and leaderboards to increase student engagement.",
        "challenges": "Designing an intuitive course creation interface that non-technical educators could use was challenging. I conducted multiple user testing sessions and iterations to optimize the UX.",
        "outcomes": "The system has been adopted by 3 educational institutions, serving over 2,000 students and 50 instructors with a 92% satisfaction rate."
      },
      {
        "id": "6",
        "title": "Smart Home Control Dashboard",
        "description": "A centralized dashboard for managing IoT devices, with automation rules and energy consumption analytics.",
        "thumbnailUrl": "assets/images/projects/smart-home.jpg",
        "imageUrls": [
          "assets/images/projects/smart-home-1.jpg",
          "assets/images/projects/smart-home-2.jpg"
        ],
        "categories": ["IoT", "Web Application"],
        "technologies": ["Vue.js", "Python", "MQTT", "GraphQL", "D3.js"],
        "featured": true,
        "demoUrl": "https://smarthome.rakibrabby.com",
        "codeUrl": "https://github.com/mrakibbd/smart-home-dashboard",
        "details": "This smart home control dashboard provides a unified interface for managing various IoT devices from different manufacturers. The system features a customizable dashboard with interactive widgets, automation rule builder with conditional logic, energy consumption monitoring and analytics, security camera feeds with motion alerts, and voice control integration with popular voice assistants.",
        "challenges": "Integrating with a wide range of IoT protocols and manufacturers' APIs required creating an extensible architecture. I implemented an adapter pattern and plugin system to allow for easy addition of new device types.",
        "outcomes": "The dashboard has reduced energy consumption by an average of 23% for users through its optimization recommendations and automated rules."
      },
      {
        "id": "7",
        "title": "Financial Portfolio Tracker",
        "description": "A comprehensive financial tracking application with investment analytics, goal planning, and market insights.",
        "thumbnailUrl": "assets/images/projects/finance.jpg",
        "imageUrls": [
          "assets/images/projects/finance-1.jpg",
          "assets/images/projects/finance-2.jpg"
        ],
        "categories": ["Web Application", "Finance"],
        "technologies": ["React", "Python", "PostgreSQL", "Redis", "Stock APIs"],
        "featured": false,
        "demoUrl": "https://finance-tracker.rakibrabby.com",
        "codeUrl": "https://github.com/mrakibbd/financial-portfolio-tracker",
        "details": "This financial portfolio tracker helps users manage their investments and plan their financial future. The application includes portfolio tracking across multiple accounts and asset classes, real-time market data and news, investment performance analysis with benchmarking, financial goal setting and tracking, tax optimization suggestions, and scenario planning tools for retirement and other major life events.",
        "challenges": "Ensuring accurate and timely financial data while keeping API costs reasonable was difficult. I implemented a sophisticated caching system and used WebSockets for real-time price updates only on actively viewed assets.",
        "outcomes": "Users report making more informed investment decisions with an average portfolio performance improvement of 4.2% compared to their pre-app performance."
      },
      {
        "id": "8",
        "title": "Restaurant Management System",
        "description": "A comprehensive system for restaurant operations including ordering, inventory, reservations, and analytics.",
        "thumbnailUrl": "assets/images/projects/restaurant.jpg",
        "imageUrls": [
          "assets/images/projects/restaurant-1.jpg",
          "assets/images/projects/restaurant-2.jpg"
        ],
        "categories": ["Web Application", "Business"],
        "technologies": ["Angular", "Java Spring Boot", "MySQL", "WebSockets", "Chart.js"],
        "featured": false,
        "demoUrl": "https://restaurant-system.rakibrabby.com",
        "codeUrl": "https://github.com/mrakibbd/restaurant-management-system",
        "details": "This restaurant management system streamlines all aspects of restaurant operations. It includes digital menu management with real-time updates, table management and reservations, kitchen order display system, inventory tracking with automatic alerts, staff scheduling and time tracking, customer relationship management with loyalty program, and comprehensive reporting and analytics.",
        "challenges": "Creating a system that could work effectively both online and offline (in case of internet outages) required implementing a sophisticated data synchronization system.",
        "outcomes": "Restaurants using this system report a 15% reduction in food waste, 22% improvement in order accuracy, and a 10% increase in table turnover rate."
      }
    ]
  }